---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailBeginningTerminationAttachmentParam
source: html/65e91f36-ae32-7c82-db05-ec214351a08a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailBeginningTerminationAttachmentParam Property

"Extension Style"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailBeginningTerminationAttachmentParam { get; }
```